# Data Wrangling in Pandas

This session draws primarily on Chapter 7 in Python for Data Analysis.  It covers methods that are used heavily in 'data wrangling', which refers to the data manipulation that is often needed to transform raw data into a form that is useful for analysis.  We'll stick to the data and examples used in the book for most of this session, since the examples are clearer on the tiny datasets.  After that we will work through some of these methods again using real data.

Key methods covered include:

* Merging and Concatenating
* Reshaping data
* Data transformations
* Categorization
* Detecting and Filtering Outliers
* Creating Dummy Variables

In [22]:
import pandas as pd
import numpy as np

## Merging

Merging two datasets is a very common operation in preparing data for analysis.  It generally means adding columns from one table to colums from another, where the value of some key, or merge field, matches.

Let's begin by creating two simple DataFrames to be merged.

In [3]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
print(df1)
print(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
  key  data2
0   a      0
1   b      1
2   d      2

Here is a many to one merge.  The join field is implicit, based on what columns it finds in common between the two dataframes. Note that they share some values of the key field (a, b), but do not share key values c and d.  What do you expect to happen when we merge them? The result contains the values from both inputs where they both have a value of the merge field, which is 'key' in this example.  The default behavior is that the key value has to be in both inputs to be kept.  In set terms it would be an intersection of the two sets.

In [7]:
pd.merge(df1,df2)#matched items only,default is inner merge
#inner merge and outer merge, left merge and right merge
#pd.merge(df1,df2, how='left')
#pd.merge(df1,df2, how='outer')
#pd.merge(df1,df2, how='right')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Here is the same merge, but making the join field explicit.

In [6]:
pd.merge(df1,df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [8]:
#what if there are more than one value of key in both dataframes? This is a many-to-many merge.
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df3 = pd.DataFrame({'key': ['a', 'b', 'b', 'd'],'data2': range(4)})
print(df1)
print(df3)
pd.merge(df1,df3, on='key')
#This produces a cartesian product of the number of occurrences of each key value in both dataframes:
# (b shows up 3 times in df1 and 2 times in df3, so we get 6 occurrences in the result of the merge)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
  key  data2
0   a      0
1   b      1
2   b      2
3   d      3

  key  data1  data2
0   b      0      1
1   b      0      2
2   b      1      1
3   b      1      2
4   b      6      1
5   b      6      2
6   a      2      0
7   a      4      0
8   a      5      0

In [9]:
# There are several types of joins: left, right, inner, and outer. Let's compare them.
# How does a 'left' join compare to our initial join?  Note that it keeps the result if it shows up in df1,
# regardless of whether it also shows up in df2.  It fills in a value of NaN for the missing value from df2.
pd.merge(df1,df3, on='key', how='left')

  key  data1  data2
0   b      0    1.0
1   b      0    2.0
2   b      1    1.0
3   b      1    2.0
4   a      2    0.0
5   c      3    NaN
6   a      4    0.0
7   a      5    0.0
8   b      6    1.0
9   b      6    2.0

In [10]:
#How does a 'right' join compare?  Same idea, but this time it keeps a result if it shows up in df2, regardless
# of whether it also shows up in df1.
pd.merge(df1,df3, on='key', how='right')

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   b    0.0      2
4   b    1.0      2
5   b    6.0      2
6   a    2.0      0
7   a    4.0      0
8   a    5.0      0
9   d    NaN      3

In [11]:
#How does an 'inner' join compare?
pd.merge(df1,df3, on='key', how='inner')
# seems to be the default argument...

  key  data1  data2
0   b      0      1
1   b      0      2
2   b      1      1
3   b      1      2
4   b      6      1
5   b      6      2
6   a      2      0
7   a      4      0
8   a      5      0

In [12]:
#How does an 'outer' join compare?  If inner joins are like an intersection of two sets, outer joins are unions.
pd.merge(df1,df3, on='key', how='outer')

   key  data1  data2
0    b    0.0    1.0
1    b    0.0    2.0
2    b    1.0    1.0
3    b    1.0    2.0
4    b    6.0    1.0
5    b    6.0    2.0
6    a    2.0    0.0
7    a    4.0    0.0
8    a    5.0    0.0
9    c    3.0    NaN
10   d    NaN    3.0

In [14]:
#What if the join fields have different names?  No problem - just specify the names.
df4 = pd.DataFrame({'key_1': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df5 = pd.DataFrame({'key_2': ['a', 'b', 'b', 'd'],'data2': range(4)})
print(df4)
print(df5)
pd.merge(df4,df5, left_on='key_1', right_on='key_2')

  key_1  data1
0     b      0
1     b      1
2     a      2
3     c      3
4     a      4
5     a      5
6     b      6
  key_2  data2
0     a      0
1     b      1
2     b      2
3     d      3

  key_1  data1 key_2  data2
0     b      0     b      1
1     b      0     b      2
2     b      1     b      1
3     b      1     b      2
4     b      6     b      1
5     b      6     b      2
6     a      2     a      0
7     a      4     a      0
8     a      5     a      0

In [15]:
# Here is an example that uses a combination of a data column and an index to merge two dataframes.
df4 = pd.DataFrame({'key_1': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df5 = pd.DataFrame({'data2': [4,6,8,10]}, index=['a','b','c','d'])
pd.merge(df4,df5, left_on='key_1', right_index=True)

  key_1  data1  data2
0     b      0      6
1     b      1      6
6     b      6      6
2     a      2      4
4     a      4      4
5     a      5      4
3     c      3      8

## Concatenating

In [23]:
# Concatenating can append rows, or columns, depending on which axis you use. Default is 0
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
pd.concat([s1, s2, s3])#default is outer, outer for union and inner for intersection
#axis : {0, 1, …}, default 0. The axis to concatenate along.
#pd.concat([s1, s2, s3],join='inner')
# Since we are concatenating series on axis 0, this creates a longer series, appending each of the three series

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [27]:
# What if we concatenate on axis 1?
pd.concat([s1, s2, s3], axis=1,sort=False)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [35]:
# Outer join is the default:
#pd.concat([s1, s2, s3], axis=1, join='outer', sort=False)
pd.concat([s1, s2, s3], axis=1, join_axes=[s2.index])

    0  1   2
c NaN  2 NaN
d NaN  3 NaN
e NaN  4 NaN

In [26]:
# What would an inner join produce?
pd.concat([s1, s2, s3], axis=1, join='inner')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [34]:
# We need some overlapping values to have the inner join produe non-empty results
s4 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s5 = pd.Series([1, 2, 3], index=['d', 'e', 'f'])
s6 = pd.Series([7, 8, 9, 10], index=['d', 'e', 'f', 'g'])
pd.concat([s4, s5, s6], axis=1, join='outer',sort=False)

     0    1     2
c  4.0  NaN   NaN
d  5.0  1.0   7.0
e  6.0  2.0   8.0
f  NaN  3.0   9.0
g  NaN  NaN  10.0

In [36]:
# Here is the inner join 
pd.concat([s4, s5, s6], axis=1, join='inner')
# Note that it contains only entries that overlap in all three series.

   0  1  2
d  5  1  7
e  6  2  8

## Reshaping with Hierarchical Indexing

In [37]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [38]:
# Stack pivots the columns into rows, producing a Series with a hierarchical index:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [39]:
# Unstack reverses this process:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

See also the related pivot method

## Data Transformations

In [42]:
# Start with a dataframe containing some duplicate values
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,'k2': [1, 1, 2, 3, 3, 4, 99]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two  99

In [43]:
# How to see which rows contain duplicate values
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [44]:
# How to remove duplicate values
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4
6  two  99

In [45]:
#If 99 is a code for missing data, we could replace any such values with NaNs
data['k2'].replace(99,np.nan)

0    1.0
1    1.0
2    2.0
3    3.0
4    3.0
5    4.0
6    NaN
Name: k2, dtype: float64

## Categorization (binning)

In [93]:
# Let's look at how to create categories of data using ranges to bin the data using cut
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
type(cats)

pandas.core.arrays.categorical.Categorical

In [94]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [48]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [49]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [51]:
# Consistent with mathematical notation for intervals, a parenthesis means that the side is open while the 
#square bracket means it is closed (inclusive). Which side is closed can be changed by passing right=False:

#open interval does not include its end point but closed one does
cats = pd.cut(ages, bins, right=False)
print(ages)
print(pd.value_counts(cats))

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

### Removing Outliers

In [53]:
# Start by creating a dataframe with 4 columns of 1,000 random numbers
# We'll use a fixed seed for the random number generator to get repeatable results
np.random.seed(12345)
data = pd.DataFrame(np.random.randn(1000, 4))
#data.describe()
data

            0         1         2         3
0   -0.204708  0.478943 -0.519439 -0.555730
1    1.965781  1.393406  0.092908  0.281746
2    0.769023  1.246435  1.007189 -1.296221
3    0.274992  0.228913  1.352917  0.886429
4   -2.001637 -0.371843  1.669025 -0.438570
5   -0.539741  0.476985  3.248944 -1.021228
6   -0.577087  0.124121  0.302614  0.523772
7    0.000940  1.343810 -0.713544 -0.831154
8   -2.370232 -1.860761 -0.860757  0.560145
9   -1.265934  0.119827 -1.063512  0.332883
10  -2.359419 -0.199543 -1.541996 -0.970736
11  -1.307030  0.286350  0.377984 -0.753887
12   0.331286  1.349742  0.069877  0.246674
13  -0.011862  1.004812  1.327195 -0.919262
14  -1.549106  0.022185  0.758363 -0.660524
15   0.862580 -0.010032  0.050009  0.670216
16   0.852965 -0.955869 -0.023493 -2.304234
17  -0.652469 -1.218302 -1.332610  1.074623
18   0.723642  0.690002  1.001543 -0.503087
19  -0.622274 -0.921169 -0.726213  0.222896
20   0.051316 -1.157719  0.816707  0.433610
21   1.010737  1.824875 -0.997518  0.850591
22  -0.131578  0.912414  0.188211  2.169461
23  -0.114928  2.003697  0.029610  0.795253
24   0.118110 -0.748532  0.584970  0.152677
25  -1.565657 -0.562540 -0.032664 -0.929006
26  -0.482573 -0.036264  1.095390  0.980928
27  -0.589488  1.581700 -0.528735  0.457002
28   0.929969 -1.569271 -1.022487 -0.402827
29   0.220487 -0.193401  0.669158 -1.648985
..        ...       ...       ...       ...
970  1.140886  0.113279  0.206782 -1.460094
971 -1.523554 -0.590572 -0.324064  0.132262
972  0.097878  1.244456 -0.048534 -1.091849
973 -0.738296  0.115881  0.016253 -1.243078
974 -1.969172 -1.141360  0.405558 -0.521155
975 -0.813280 -0.461413  1.159668 -0.307670
976  0.669147  0.397355  0.612537  1.381155
977 -0.042541  1.182125  0.153036  0.075798
978  0.615651 -1.992291  0.963044  0.102469
979  0.359400  0.355787 -0.799366  1.120895
980 -0.261844 -0.474138 -0.112021 -0.285176
981 -0.136429  1.285628  0.753586  0.053410
982 -0.355393  0.790731  1.274794  0.233619
983 -1.316005  1.396082  0.336700  0.604880
984  0.675317 -0.060329  1.801953 -0.335099
985 -0.754114  0.650691  0.365401  1.367213
986 -0.105654 -0.001860  0.316802 -0.512542
987 -0.052736 -0.457225  2.452835 -1.050942
988 -0.172078  0.853049 -0.356263 -0.387002
989  0.881601  1.067288  1.079688  1.642339
990 -0.103672 -0.882949 -0.197357  1.336648
991  0.926782 -0.527103  0.633763  0.153988
992 -0.527754  0.815104 -0.677870 -1.466596
993  0.957144  0.377342 -0.383241  1.101972
994  1.221058 -0.326481  0.750008  0.604072
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

[1000 rows x 4 columns]

In [54]:
# This identifies any values in column 3 with absolute values > 3
col = data[3]
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [55]:
# This identifies all the rows with any column containing absolute values > 3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [56]:
# Now we can cap the values at -3 to 3 using this:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

### Computing Dummy Variables

In [57]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df
#dummy variables are flag

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [58]:
# This generates dummy variables for each value of key
# Dummy variables are useful in statistical modeling, to have 0/1 indicator
# variables for the presence of some condition
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [59]:
# This generates dummy variables for each value of key and appends these to the dataframe
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

Notice that we used join instead of merge.  The join method is very similar to merge, but uses indexes to merge, by default.  From the documentation:

http://pandas.pydata.org/pandas-docs/stable/merging.html#database-style-dataframe-joining-merging
merge is a function in the pandas namespace, and it is also available as a DataFrame instance method, with the calling DataFrame being implicitly considered the left object in the join.

The related DataFrame.join method, uses merge internally for the index-on-index and index-on-column(s) joins, but joins on indexes by default rather than trying to join on common columns (the default behavior for merge). If you are joining on index, you may wish to use DataFrame.join to save yourself some typing

## A bit more: 
1. Filter out records with more than 4 bedrooms
2. Create dummy variables for each bedroom count (e.g. bed_1 would have 1 for rows with 1 bedroom, 0 for others), and merge them with the dataframe
3. Filter sqft < 500 and > 3000
4. Create a set of 5 bins for price and do counts of how many records are in each category

In [62]:
df = pd.read_csv('C:/Users/moni_/OneDrive - University of Kentucky/ce599/ce599/04-Data Files and Cleaning/Data/rents_raw.csv')
df

,neighborhood,price,bedrooms,date,sqft,longitude,latitude
0,foster city,2495.0,1.0,11/14/2014 12:26,755.0,-122.270000,37.553800
1,palo alto,2695.0,NaN,11/14/2014 12:25,443.0,-122.161524,37.450289
2,brisbane,3150.0,2.0,11/14/2014 12:24,1242.0,-122.417912,37.692415
3,palo alto,2800.0,2.0,11/14/2014 12:24,NaN,NaN,NaN
4,san mateo,2196.0,1.0,11/14/2014 12:24,676.0,-122.299800,37.539500
5,santa clara,3264.0,3.0,11/14/2014 12:28,1138.0,NaN,NaN
6,san jose south,2000.0,2.0,11/14/2014 12:28,822.0,-121.902268,37.253503
7,sunnyvale,4740.0,3.0,11/14/2014 12:28,1406.0,-122.034683,37.368445
8,inner sunset / UCSF,3395.0,2.0,11/14/2014 12:32,NaN,-122.479345,37.764582
9,richmond / seacliff,2699.0,1.0,11/14/2014 12:32,NaN,-122.503781,37.771800
10,SOMA / south beach,3620.0,1.0,11/14/2014 12:30,860.0,-122.395195,37.775133
11,dublin / pleasanton / livermore,2025.0,1.0,11/14/2014 12:18,636.0,-121.787665,37.679630
12,concord / pleasant hill / martinez,NaN,2.0,11/14/2014 12:18,1019.0,-122.035275,37.975259
13,"hercules, pinole, san pablo, el sob",1795.0,1.0,11/14/2014 12:17,715.0,-122.321672,37.978086
14,corte madera,4299.0,3.0,11/14/2014 12:33,1533.0,-122.488541,37.919834

In [72]:
import pandas as pd
import numpy as np
#Query the columns of a DataFrame with a boolean expression
data_filtered = df.query('bedrooms>4')
data_filtered

Empty DataFrame
Columns: [neighborhood, price, bedrooms, date, sqft, longitude, latitude]
Index: []

In [64]:
dummies = pd.get_dummies(df['bedrooms'], prefix='bed')
df_with_dummy = df.join(dummies)
df_with_dummy

,neighborhood,price,bedrooms,date,sqft,longitude,latitude,bed_1.0,bed_2.0,bed_3.0
0,foster city,2495.0,1.0,11/14/2014 12:26,755.0,-122.270000,37.553800,1,0,0
1,palo alto,2695.0,NaN,11/14/2014 12:25,443.0,-122.161524,37.450289,0,0,0
2,brisbane,3150.0,2.0,11/14/2014 12:24,1242.0,-122.417912,37.692415,0,1,0
3,palo alto,2800.0,2.0,11/14/2014 12:24,NaN,NaN,NaN,0,1,0
4,san mateo,2196.0,1.0,11/14/2014 12:24,676.0,-122.299800,37.539500,1,0,0
5,santa clara,3264.0,3.0,11/14/2014 12:28,1138.0,NaN,NaN,0,0,1
6,san jose south,2000.0,2.0,11/14/2014 12:28,822.0,-121.902268,37.253503,0,1,0
7,sunnyvale,4740.0,3.0,11/14/2014 12:28,1406.0,-122.034683,37.368445,0,0,1
8,inner sunset / UCSF,3395.0,2.0,11/14/2014 12:32,NaN,-122.479345,37.764582,0,1,0
9,richmond / seacliff,2699.0,1.0,11/14/2014 12:32,NaN,-122.503781,37.771800,1,0,0
10,SOMA / south beach,3620.0,1.0,11/14/2014 12:30,860.0,-122.395195,37.775133,1,0,0
11,dublin / pleasanton / livermore,2025.0,1.0,11/14/2014 12:18,636.0,-121.787665,37.679630,1,0,0
12,concord / pleasant hill / martinez,NaN,2.0,11/14/2014 12:18,1019.0,-122.035275,37.975259,0,1,0
13,"hercules, pinole, san pablo, el sob",1795.0,1.0,11/14/2014 12:17,715.0,-122.321672,37.978086,1,0,0
14,corte madera,4299.0,3.0,11/14/2014 12:33,1533.0,-122.488541,37.919834,0,0,1

In [71]:
data_filtered1 = df.query('sqft<500 & sqft>3000 ')
data_filtered1

Empty DataFrame
Columns: [neighborhood, price, bedrooms, date, sqft, longitude, latitude]
Index: []

In [77]:
df['price'].min()

1795.0

In [78]:
df['price'].max()

4740.0

In [79]:
df['price'].mean()

2940.9285714285716

In [91]:
price= df['price']
bins = [1790, 2390, 2990,3590, 4190,4790]
cats = pd.cut(price,bins)

In [86]:
pd.value_counts(cats)

(2390, 2990]    4
(1790, 2390]    4
(2990, 3590]    3
(4190, 4790]    2
(3590, 4190]    1
Name: price, dtype: int64

In [87]:
type(cats)

pandas.core.series.Series

In [90]:
type(cats)

AttributeError: 'Series' object has no attribute 'categories'